name: "mnist_classifier"
backend: "onnxruntime"

input [
    {
        name: "IMAGES"
        data_type: TYPE_FP32
        dims: [ -1, 1, 28, 28 ]
    }
]

output [
    {
        name: "CLASS_PROBS"
        data_type: TYPE_FP32
        dims: [ -1, 10 ]
    }
]

instance_group [ { count: 2 }]
optimization { execution_accelerators {
    cpu_execution_accelerator : [ {
      name : "openvino"
    }]
  }}
dynamic_batching {}
